{
    "intents": [
        {
            "tag": "postgraduate_programs",
            "patterns": [
                "Does PUCIT offer any programs for postgraduate studies?"
            ],
            "responses": [
                " Yes, PUCIT offers several postgraduate programs, including MS in Computer Science, MS in Software Engineering, MS in Information Technology, and Ph.D. in Computer Science. "
            ]
        },
        {
            "tag": "program_duration",
            "patterns": [
                "What is the maximum duration of the Bachelor of Science in Computer Science program at PUCIT?"
            ],
            "responses": [
                "The maximum duration of the Bachelor of Science in Computer Science program at PUCIT is four years."
            ]
        },
        {
            "tag": "teaching_methods_adaptation",
            "patterns": [
                "How has PUCIT adapted its teaching methods in response to the COVID-19 pandemic?"
            ],
            "responses": [
                " PUCIT has adapted its teaching methods in response to the COVID-19 pandemic by shifting to online and hybrid modes of instruction."
            ]
        },
        {
            "tag": "international_students",
            "patterns": [
                " Can international students apply to FCIT?"
            ],
            "responses": [
                " Yes, international students are welcome to apply to FCIT. "
            ]
        },
        {
            "tag": "career_counseling",
            "patterns": [
                "What type of career counseling and job placement services does FCIT offer to its graduates?"
            ],
            "responses": [
                " FCIT provides career counseling and job placement services to its graduates, including assistance with resume writing, interview preparation, and job search strategies. "
            ]
        },
        {
            "tag": "coding_competitions",
            "patterns": [
                " Can FCIT students participate in hackathons and other coding competition?"
            ],
            "responses": [
                " Yes, FCIT students can participate in hackathons and other coding competitions. The university regularly organizes and sponsors coding events, and students are encouraged to participate and showcase their skills. "
            ]
        },
        {
            "tag": "extracurricular_activities",
            "patterns": [
                " Does FCIT offer any extracurricular activities for students?"
            ],
            "responses": [
                " Yes, FCIT offers a number of extracurricular activities for students, including sports, drama, music, programming societies, and more. "
            ]
        },
        {
            "tag": "facilities",
            "patterns": [
                "What kind of facilities does FCIT offer for students?"
            ],
            "responses": [
                "FCIT offers state-of-the-art facilities for students, including modern classrooms, computer labs, a library, a cafeteria, and recreational facilities."
            ]
        },
        {
            "tag": "faculty_academic_background",
            "patterns": [
                "What is the faculty's academic background at FCIT?"
            ],
            "responses": [
                " The faculty at FCIT has a strong academic background, with many holding PhDs and other advanced degrees from reputable institutions around the world. "
            ]
        },
        {
            "tag": "scholarships",
            "patterns": [
                "Which scholarships does FCIT offer?"
            ],
            "responses": [
                " FCIT offers a number of scholarships for eligible students, including the Punjab Educational Endowment Fund (PEEF) scholarship, the HEC need-based scholarship, and the FCIT merit scholarship."
            ]
        },
        {
            "tag": "scholarships",
            "patterns": [
                " Does FCIT offer any scholarships for students?"
            ],
            "responses": [
                "Yes, FCIT offers a number of scholarships for eligible students, including the Punjab Educational Endowment Fund (PEEF) scholarship, the HEC need-based scholarship, and the FCIT merit scholarship."
            ]
        },
        {
            "tag": "campus_choice",
            "patterns": [
                "Is it our choice to either choose new campus or old campus ?"
            ],
            "responses": [
                "Yes, students can set preferences at the time of admission where they want to study."
            ]
        },
        {
            "tag": "field_scope",
            "patterns": [
                "Which field has better scope ?"
            ],
            "responses": [
                "There is no such thing as “better scoper” because they all lead to different careers and have different specializations or subfields. Either discipline is a great choice for your studies, as long as you're passionate about technology, and you understand what each study option implies."
            ]
        },
        {
            "tag": "field_merits",
            "patterns": [
                "Which field has higher merits ?"
            ],
            "responses": [
                "General trend is CS with the highest merit, then SE and then IT field respectively."
            ]
        },
        {
            "tag": "BS_CS_courses",
            "patterns": [
                " What type of courses are offered in BS Cs degree ?"
            ],
            "responses": [
                "As computer scientists design and develop software programs, courses like Analysis of Algorithm, Computer Organization and Assembly Language, Statistics, AI and many other courses are offered during the 4-year program"
            ]
        },
        {
            "tag": "BS_CS_merit",
            "patterns": [
                "What was the merit of BS CS morning last year ?"
            ],
            "responses": [
                "The merit of BS CS (new campus) was 97.75% in 2021 and 97.45%(old campus)."
            ]
        },
        {
            "tag": "campus_outside_Lahore",
            "patterns": [
                "Is there any campus outside Lahore ?"
            ],
            "responses": [
                "No, there is no FCIT campus outside lahore. Both campuses are located within lahore."
            ]
        },
        {
            "tag": "acceptance_rate",
            "patterns": [
                "What is the pucit acceptance rate?"
            ],
            "responses": [
                "Acceptance rate of FCIT is 1.65%"
            ]
        },
        {
            "tag": "minimum_criteria",
            "patterns": [
                "What is the minimum criteria to apply to pucit?"
            ],
            "responses": [
                "Minimum criteria for applying for bachelors in pucit is 50% marks in FSC(pre-engineering, pre-medical) or in ICS and student has to take respective USAT test."
            ]
        },
        {
            "tag": "pre-medical_background",
            "patterns": [
                "Can a student with pre-medical background apply for bachelors in pucit?"
            ],
            "responses": [
                "Yes a student with 50% marks in pre-medical in Fsc can apply for bachelors in FCIT and he/she also has to clear the USAT-M test."
            ]
        },
        {
            "tag": "marks_required_fsc",
            "patterns": [
                "How many marks are required in fsc for admission in bachelors in pucit ?"
            ],
            "responses": [
                "50% marks in either Pre-Engineering , ICS or medical and respective USAT test are required for admission in FCIT for bachelors."
            ]
        },
        {
            "tag": "arts_in_fsc",
            "patterns": [
                "Can a student with arts in fsc apply in pucit ?"
            ],
            "responses": [
                "No, you can not pursue admission in FCIT after your 12th with Arts stream."
            ]
        },
        {
            "tag": "old_campus_location",
            "patterns": [
                "Where is the old campus located ?"
            ],
            "responses": [
                "Old campus of FCIT is located near new Anarkali bazaar Lahore."
            ]
        },
        {
            "tag": "new_campus_location",
            "patterns": [
                "Where is the new campus located ?"
            ],
            "responses": [
                "New campus also known as Quaid-e-Azam campus is located new Suparco office on samsani road near hanjarwal Lahore."
            ]
        },
        {
            "tag": "library",
            "patterns": [
                "Is there a library in pucit ?"
            ],
            "responses": [
                "Yes both campuses of FCIT have on campus libraries with updated course books and other books, novels as well."
            ]
        },
        {
            "tag": "computer_labs",
            "patterns": [
                "How many computer labs does pucit new campus have ?"
            ],
            "responses": [
                "There are 7-8 labs in FCIT new campus including general purpose, FYP and other computing labs including computer vision ,DLD and networking lab."
            ]
        },
        {
            "tag": "starting_salary",
            "patterns": [
                "What is the starting salary of graduates from pucit?"
            ],
            "responses": [
                "The starting salary of graduates from pucit is around 90000 Pkr."
            ]
        },
        {
            "tag": "FCIT_meaning",
            "patterns": [
                "What does FCIT stand for ?"
            ],
            "responses": [
                "It stands for Faculty of computing and information technology."
            ]
        },
        {
            "tag": "QS_ranking",
            "patterns": [
                "What is the Qs ranking of pucit ?"
            ],
            "responses": [
                "QS ranking of pucit is 451-800"
            ]
        },
        {
            "tag": "societies",
            "patterns": [
                "How many societies does FCIT have?"
            ],
            "responses": [
                "Fcit has 8 different societies and clubs for students including sports, media and some programming societies including GDSC etc."
            ]
        },
        {
            "tag": "current_enrollment",
            "patterns": [
                "How many students are currently enrolled in FCIT?"
            ],
            "responses": [
                "2242 students are currently enrolled in FCIT."
            ]
        },
        {
            "tag": "PUCIT_to_FCIT_change_reason",
            "patterns": [
                "Why did pucit changed to FCIT?"
            ],
            "responses": [
                "Given the significance and impact of computing, the establishment of an independent computing faculty became the need of the hour.Prior to the establishment of FCIT, PUCIT was placed under the Faculty of Science."
            ]
        },
        {
            "tag": "BSCS_campus_preference",
            "patterns": [
                "Which PUCIT campus is better for a BSCS, an old campus or a new campus?"
            ],
            "responses": [
                "Both the old and new campuses of the Punjab University College of Information Technology (PUCIT) offer excellent facilities and resources for students pursuing a Bachelor of Science in Computer Science (BSCS) degree. It ultimately depends on personal preferences and priorities. The old campus has a more traditional and established atmosphere, while the new campus offers state-of-the-art facilities and cutting-edge technology. Additionally, the new campus is located in a more convenient location, closer to public transportation and other amenities. Ultimately, it is recommended that you visit both campuses in person and speak with current students and faculty to make an informed decision."
            ]
        },
        {
            "tag": "CS_vs_IT",
            "patterns": [
                "What is difference between CS and IT?"
            ],
            "responses": [
                "As computer scientists design and develop the software programs that IT professionals use and maintain. So, during your 4 years, relevant courses will be offered at FCIT to prepare the students for industry."
            ]
        },
        {
            "tag": "CS_vs_IT",
            "patterns": [
                "How does a CS degree differ from an IT degree ? "
            ],
            "responses": [
                "As computer scientists design and develop the software programs that IT professionals use and maintain. So, during your 4 years, relevant courses will be offered at FCIT to prepare the students for industry."
            ]
        },
        {
            "tag": "undergraduate_programs",
            "patterns": [
                "What programs does PUCIT offer for undergraduate students?"
            ],
            "responses": [
                "PUCIT offers undergraduate and graduate programs in computer science and information technology, including BSc Computer Science, BSc Software Engineering, and MSc Computer Science."
            ]
        },
        {
            "tag": "department_degrees",
            "patterns": [
                "What degrees programs are offered by these four departments?"
            ],
            "responses": [
                "PUCIT offers undergraduate and graduate programs in computer science and information technology, including BSc Computer Science, BSc Software Engineering, and MSc Computer Science."
            ]
        },
        {
            "tag": "programs_offered",
            "patterns": [
                " What programs does PUCIT offer?"
            ],
            "responses": [
                " PUCIT offers undergraduate and graduate programs in computer science and information technology, including BSc Computer Science, BSc Software Engineering, and MSc Computer Science."
            ]
        },
        {
            "tag": "graduate_program_application_process",
            "patterns": [
                "What is the process for applying for graduate programs?"
            ],
            "responses": [
                "The admission process for PUCIT usually involves taking an entrance exam and meeting the minimum eligibility criteria, such as passing intermediate exams with a minimum score. The specific admission requirements may vary depending on the program you are applying for, so it's best to check the official PUCIT website for the most up-to-date information."
            ]
        },
        {
            "tag": "admission_process",
            "patterns": [
                " What is the admission process for PUCIT?"
            ],
            "responses": [
                " The admission process for PUCIT usually involves taking an entrance exam and meeting the minimum eligibility criteria, such as passing intermediate exams with a minimum score. The specific admission requirements may vary depending on the program you are applying for, so it's best to check the official PUCIT website for the most up-to-date information."
            ]
        },
        {
            "tag": "campus_description",
            "patterns": [
                " What is the campus like at PUCIT?"
            ],
            "responses": [
                " PUCIT has a modern and well-equipped campus, with a variety of facilities for students including lecture halls, computer labs, libraries, and sports facilities. The college is known for its supportive and inclusive environment, and students from diverse backgrounds are encouraged to pursue their studies at PUCIT."
            ]
        },
        {
            "tag": "PUCIT_history",
            "patterns": [
                " What is the history of PUCIT?"
            ],
            "responses": [
                " PUCIT was established in 2000 as a college of the University of the Punjab. It was founded with the goal of providing high-quality education and research in the fields of computer science and information technology. Over the years, PUCIT has grown into one of the leading institutions of its kind in Pakistan, with a strong reputation for its academic programs and its contributions to the field of computer science and information technology."
            ]
        },
        {
            "tag": "faculty_description",
            "patterns": [
                " What is the faculty like at PUCIT?"
            ],
            "responses": [
                " PUCIT has a highly qualified and experienced faculty, consisting of experts in the fields of computer science and information technology. The faculty is committed to providing students with a top-notch education and is actively involved in cutting-edge research in these fields. In addition, PUCIT provides opportunities for students to work with faculty members on research projects and other initiatives, helping to further their education and prepare them for careers in the field."
            ]
        },
        {
            "tag": "undergraduate_research_opportunities",
            "patterns": [
                "Can you provide information about research opportunities for undergraduate students?"
            ],
            "responses": [
                "The faculty and students at PUCIT are involved in a wide range of research projects, covering a variety of topics in the fields of computer science and information technology. This may include areas such as artificial intelligence, data science, computer networks, software engineering, and more. PUCIT is also home to a number of research centers and institutes, where students and faculty can collaborate and advance the field through their work."
            ]
        },
        {
            "tag": "research_at_PUCIT",
            "patterns": [
                " What types of research are conducted at PUCIT? "
            ],
            "responses": [
                " The faculty and students at PUCIT are involved in a wide range of research projects, covering a variety of topics in the fields of computer science and information technology. This may include areas such as artificial intelligence, data science, computer networks, software engineering, and more. PUCIT is also home to a number of research centers and institutes, where students and faculty can collaborate and advance the field through their work."
            ]
        },
        {
            "tag": "career_opportunities_for_graduates",
            "patterns": [
                " What career opportunities are available for PUCIT graduates?"
            ],
            "responses": [
                " PUCIT graduates are highly sought after by employers, and are well-prepared for careers in the fields of computer science and information technology. They may go on to work in industries such as software development, data analysis, network administration, and more. In addition, many PUCIT graduates choose to pursue advanced degrees, such as a master's or PhD, to further their education and increase their career opportunities."
            ]
        },
        {
            "tag": "teacher_qualifications",
            "patterns": [
                " What qualifications do the teachers at PUCIT have?"
            ],
            "responses": [
                " The teachers at PUCIT are highly qualified experts in the fields of computer science and information technology. Many of them hold advanced degrees, such as PhDs, and have extensive experience in their areas of expertise. They are dedicated to providing students with a top-notch education and are committed to staying up-to-date with the latest developments in their fields."
            ]
        },
        {
            "tag": "teacher_professional_development",
            "patterns": [
                " How does PUCIT support its teachers in their professional development?"
            ],
            "responses": [
                " PUCIT provides its teachers with a supportive and inclusive environment that encourages professional growth and development. This may include opportunities for teachers to attend conferences, participate in research projects, and engage in professional development activities. In addition, PUCIT provides resources and support to help its teachers stay up-to-date with the latest trends and best practices in teaching and research."
            ]
        },
        {
            "tag": "teaching_style",
            "patterns": [
                " What is the teaching style like at PUCIT?"
            ],
            "responses": [
                " The teaching style at PUCIT is student-centered and interactive, with a focus on hands-on learning and real-world applications. Teachers at PUCIT use a variety of teaching methods, including lectures, discussions, hands-on projects, and case studies, to help students understand complex concepts and develop practical skills. The college is also known for its supportive and inclusive environment, where students from diverse backgrounds are encouraged to ask questions, participate in class, and engage with the material."
            ]
        },
        {
            "tag": "research_projects_with_teachers",
            "patterns": [
                " What opportunities are there for students to work with teachers on research projects at PUCIT?"
            ],
            "responses": [
                " PUCIT provides students with many opportunities to work with teachers on research projects and other initiatives. This may include opportunities to assist with ongoing research projects, participate in independent studies, or pursue their own research interests. These experiences can help students gain valuable hands-on experience and make meaningful contributions to the field, while also providing a unique opportunity to work closely with their teachers and learn from them in a more personal setting."
            ]
        },
        {
            "tag": "admission_process",
            "patterns": [
                " What is the admission process like at PUCIT?"
            ],
            "responses": [
                " The admission process at PUCIT typically involves submitting an application, along with relevant academic transcripts and test scores, and meeting the university's minimum admission requirements. Additional requirements, such as interviews or essays, may also be required for some programs."
            ]
        },
        {
            "tag": "facilities",
            "patterns": [
                " What are the facilities like at PUCIT?"
            ],
            "responses": [
                " PUCIT provides students with a range of facilities and resources to support their academic and personal growth. This may include modern classrooms and labs, access to a library and other academic resources, and student services such as career services and counseling."
            ]
        },
        {
            "tag": "campus_life",
            "patterns": [
                "What is the campus life like at PUCIT?"
            ],
            "responses": [
                " PUCIT is known for its supportive and inclusive campus culture, where students from diverse backgrounds are encouraged to engage with each other and with the university community. There are many opportunities for students to get involved in campus life, including student organizations, clubs, and events."
            ]
        },
        {
            "tag": "campus_culture",
            "patterns": [
                " What is the campus culture like at PUCIT? "
            ],
            "responses": [
                " PUCIT is known for its supportive and inclusive campus culture, where students from diverse backgrounds are encouraged to engage with each other and with the university community. There are many opportunities for students to get involved in campus life, including student organizations, clubs, and events."
            ]
        },
        {
            "tag": "faculty_to_student_ratio",
            "patterns": [
                " What is the faculty to student ratio at PUCIT?"
            ],
            "responses": [
                " The faculty to student ratio at PUCIT varies depending on the program and the specific course, but the university is committed to providing students with a supportive and engaging learning environment. There is a good balance between the number of faculty and students, ensuring that students receive individual attention and support from their instructors."
            ]
        },
        {
            "tag": "practical_experience_opportunities",
            "patterns": [
                " What opportunities are there for students to gain practical experience at PUCIT?"
            ],
            "responses": [
                " PUCIT provides students with many opportunities to gain practical experience through internships, co-op programs, and other hands-on learning opportunities. These experiences allow students to apply what they have learned in the classroom to real-world situations and develop important skills and connections in their field."
            ]
        },
        {
            "tag": "cost_of_attendance",
            "patterns": [
                " What is the cost of attending PUCIT?"
            ],
            "responses": [
                " The cost of attending PUCIT depends on several factors, including the program of study, the length of enrollment, and the student's residency status. I suggest visiting the PUCIT website or contacting the university directly for a more accurate estimate of the cost of attendance."
            ]
        },
        {
            "tag": "student_support_services",
            "patterns": [
                " What support services are available to students at PUCIT?"
            ],
            "responses": [
                " PUCIT provides students with a range of support services to help them succeed in their academic and personal lives. This may include academic advising, tutoring, career services, counseling, and more. The university is committed to helping students succeed and provides a supportive and inclusive environment to help them reach their goals."
            ]
        },
        {
            "tag": "PUCIT_ranking",
            "patterns": [
                " How is PUCIT ranked compared to other universities?"
            ],
            "responses": [
                " PUCIT is considered one of the top universities in Pakistan for computer science and information technology. It has a strong reputation for its programs and facilities, and is known for producing well-prepared and successful graduates. However, the specific ranking of PUCIT can vary depending on the criteria and methodology used by different organizations and publications."
            ]
        },
        {
            "tag": "student_population",
            "patterns": [
                " What is the student population like at PUCIT?"
            ],
            "responses": [
                " The student population at PUCIT is diverse and includes students from many different backgrounds and countries. There is a strong sense of community among students, who are encouraged to engage with each other and with the university community."
            ]
        },
        {
            "tag": "location_description",
            "patterns": [
                " What is the location of PUCIT like?"
            ],
            "responses": [
                " PUCIT is located in Lahore, Pakistan, a vibrant and dynamic city known for its rich cultural heritage, historical sites, and modern amenities. The university is situated in a convenient and accessible location, close to public transportation and many other resources."
            ]
        },
        {
            "tag": "career_opportunities_for_graduates",
            "patterns": [
                " What kind of career opportunities are available for graduates of PUCIT?"
            ],
            "responses": [
                " PUCIT graduates are well-prepared for a range of careers in computer science and information technology, including software development, data analysis, network and security administration, and more. Many PUCIT graduates go on to work for leading companies in the field, while others start their own businesses or pursue advanced degrees."
            ]
        },
        {
            "tag": "campus_environment",
            "patterns": [
                " What is the campus environment like at PUCIT?"
            ],
            "responses": [
                " The campus environment at PUCIT is welcoming, inclusive, and supportive. There are many opportunities for students to get involved in campus life, including clubs, organizations, and events. The university also provides a range of resources and services to support students' academic and personal growth."
            ]
        },
        {
            "tag": "curriculum_description",
            "patterns": [
                " What is the curriculum like at PUCIT?"
            ],
            "responses": [
                " The curriculum at PUCIT is designed to provide students with a comprehensive education in computer science and information technology. It covers a range of subjects, including programming, data structures and algorithms, database management, and more. The curriculum is regularly updated to reflect the latest developments in the field."
            ]
        },
        {
            "tag": "academic_calendar",
            "patterns": [
                " What is the academic calendar like at PUCIT?"
            ],
            "responses": [
                " The academic calendar at PUCIT typically consists of two semesters, with a summer session available for some programs. Classes are usually held from Monday to Friday, with exams and other assessments taking place throughout the semester."
            ]
        },
        {
            "tag": "scholarships",
            "patterns": [
                " Are scholarships available to students at PUCIT?"
            ],
            "responses": [
                " Yes, PUCIT offers a range of scholarships and financial aid options to help students finance their education. These may include merit-based scholarships, need-based grants, and loans. I suggest visiting the PUCIT website or contacting the university directly for more information on the specific financial aid options available."
            ]
        },
        {
            "tag": "residence_policy",
            "patterns": [
                " What is the residence policy like at PUCIT?"
            ],
            "responses": [
                " The residence policy at PUCIT varies depending on the student's program and other factors. Some students may choose to live on campus in university-owned or affiliated housing, while others may choose to live off campus. I suggest visiting the PUCIT website or contacting the university directly for more information on the specific residence options available."
            ]
        },
        {
            "tag": "teaching_philosophy",
            "patterns": [
                " What is the teaching philosophy at PUCIT?"
            ],
            "responses": [
                " The teaching philosophy at PUCIT is based on a commitment to providing students with a rigorous and engaging education. The university emphasizes hands-on learning, critical thinking, and problem-solving, and encourages students to take an active role in their education. The faculty is dedicated to helping students succeed and provides a supportive and inclusive learning environment."
            ]
        },
        {
            "tag": "workforce_preparation",
            "patterns": [
                " How does PUCIT prepare students for the workforce?"
            ],
            "responses": [
                " PUCIT prepares students for the workforce through a combination of academic coursework, hands-on learning experiences, and career development resources. The university provides students with the skills and knowledge they need to succeed in their careers, and helps them connect with employers and build their professional networks."
            ]
        },
        {
            "tag": "PUCIT_dress_code_male",
            "patterns": [
                " What is PUCIT dress code for male students?"
            ],
            "responses": [
                " Shorts of any kind must not be part of the attire. Clothes should not be skin-tight. Loose-neck shirts are prohibited. Low-hung (hanging below waistline) pants are not allowed. Sunglasses or p-caps must not be worn in classrooms. Slippers are not allowed. Shirts with pictures or text printed on front or back are not allowed. However, shirts with small logos or emblems are acceptable."
            ]
        },
        {
            "tag": "PUCIT_dress_code_female",
            "patterns": [
                " What is PUCIT dress code for female students?"
            ],
            "responses": [
                " Dupatta must be part of the attire. Shirts should not be over-fitted, or see-through. Shirt length should at least knee-length or longer. Length of sleeves must be three quarters or more. Necklines must be non-revealing. Fitted trousers, choori-dar pajamas, or tights must be accompanied by calf-length (half-way between knees and ankles) or longer length shirts without slits. Trousers must be ankle-length or longer."
            ]
        },
        {
            "tag": "dress_code_violation_penalty",
            "patterns": [
                " What is Penalty for dress code violation?"
            ],
            "responses": [
                "For a first offense, the student will be given verbal warning by the teacher. For a second offence, the students card will be taken and sent to SAC. SAC will issue as strict warning letter signed and approved by the Principal. The warning letter will be put in student file. For a third offense, the case will be forwarded to SAC and student will be suspended for one week from college rolls. The student will not be allowed to enter college premises in this period. For a fourth offense, the case will be forwarded to DC."
            ]
        },
        {
            "tag": "PUCIT_email_services",
            "patterns": [
                " What are PUCIT email services?"
            ],
            "responses": [
                "Using this service students and faculty members may communicate with one another. Students groups of different batches and programs are created for the ease of faculty and program coordinators for prompt message communication."
            ]
        },
        {
            "tag": "PUCIT_Campus_Management_Services",
            "patterns": [
                " What are PUCIT Campus Management Services?"
            ],
            "responses": [
                "Campus Management System or CMS is an in-house developed system by the FCIT. Using this system, students may obtain their semester wise progress report as well as their attendance rolls and can print out their fee vouchers etc. Similarly, this portal is also very useful for faculty and degree coordinators as well as program coordinators for marking students’ attendance and exam related seeding inputs."
            ]
        },
        {
            "tag": "FCIT_departments",
            "patterns": [
                " How many departments are there under FCIT?"
            ],
            "responses": [
                "There are four departments under FCIT:"
            ]
        },
        {
            "tag": "admission_season",
            "patterns": [
                " When does FCIT offer admission to its BS, M.Phil. & PhD Programs?"
            ],
            "responses": [
                " FCIT offers admission to all undergraduate and graduate programs for Fall Semester only. Exact dates are announced through print and electronic media (newspaper, PUCIT website, PU website and social media)."
            ]
        },
        {
            "tag": "entrance_test",
            "patterns": [
                " Which  entrance test is required for admission in FCIT?"
            ],
            "responses": [
                " USAT by HEC is mandatory to apply for admission in all departments of FCIT in undergraduate programs. Graduate admission test is held by the respective departments."
            ]
        },
        {
            "tag": "alternative_standardized_tests",
            "patterns": [
                " Does FCIT consider any other standardized tests for admission (NTS, SAT, etc.)?"
            ],
            "responses": [
                " No"
            ]
        },
        {
            "tag": "session_admission",
            "patterns": [
                " Does FCIT offer admission to the afternoon or evening session?"
            ],
            "responses": [
                " There will be no admission in afternoon/replica or evening program in Fall 2022. However, Department of Data Science offers BS DS in both Morning and Afternoon/Self Support sessions."
            ]
        },
        {
            "tag": "program_fees",
            "patterns": [
                " What are the fees for the undergraduate and graduate program?"
            ],
            "responses": [
                " Please check this page for fee information: https://pucit.edu.pk/fee-structure"
            ]
        },
        {
            "tag": "degree_accreditation",
            "patterns": [
                " Are the degrees offered by the departments under FCIT, HEC recognized and accredited by PEC or NCEAC?"
            ],
            "responses": [
                "We are under process of accreditation of our degree programs. However, BSCS, BSSE, BSIT degrees of 2015 batch has already been accredited by NCEAC with the highest “W” Category."
            ]
        },
        {
            "tag": "hostel_facility",
            "patterns": [
                " Does FCIT provide hostel facility?"
            ],
            "responses": [
                " University of the Punjab hostel facility is available for students admitted to the morning/regular programs only."
            ]
        },
        {
            "tag": "transport_facility",
            "patterns": [
                " Does FCIT give any transport facility to the students?"
            ],
            "responses": [
                " Yes, University of the Punjab bus service is available for different routes in the city."
            ]
        },
        {
            "tag": "class_timings",
            "patterns": [
                " What are the timings for classes at FCIT? "
            ],
            "responses": [
                "Morning classes at PUCIT typically start around 8:30 AM or 9:00 AM and may extend until 1:00pm. However, timings can vary based on the program and semester schedule. For the most accurate information, please refer to the official PUCIT website or contact the relevant department."
            ]
        },
        {
            "tag": "Spring_semester_admissions",
            "patterns": [
                " Does FCIT offer admissions for the Spring semester?"
            ],
            "responses": [
                "No."
            ]
        },
        {
            "tag": "BS_classes_location",
            "patterns": [
                " Where are classes of undergraduate (BS ) programs held?"
            ],
            "responses": [
                " The classes for BS (CS, SE IT, DS) programs are held at both campuses of the college, i.e. Old campus and New Campus."
            ]
        },
        {
            "tag": "graduate_classes_location",
            "patterns": [
                " Where are the classes of graduate program held?"
            ],
            "responses": [
                " The classes for graduate programs are held at both Old Campus and New Campus. However, for Fall 2021 batch, the classes were held in New Campus only."
            ]
        },
        {
            "tag": "PhD_teachers",
            "patterns": [
                " How many PhD teachers does FCIT have?"
            ],
            "responses": [
                " FCIT currently has 29 PhD faculty members out of 56 faculty members, including Fulbright Scholars, Erasmus Mundus Scholars."
            ]
        },
        {
            "tag": "PhD_research_areas",
            "patterns": [
                " What are the areas of research of the PhD teachers at FCIT?"
            ],
            "responses": [
                "The PhD teachers at FCIT are currently pursuing research in the following areas:"
            ]
        },
        {
            "tag": "available_seats",
            "patterns": [
                "How many seats are available?"
            ],
            "responses": [
                "Following are the number of seats:BS Computer Science (Morning/Regular)-around 40 for each campus BS Information Technology (Morning/Regular)-around 40 for each campus BS Software Engineering (Morning/Regular)-around 40 for each campus BS Data Science (Morning/Regular)-40 for new campus BS Data Science (Self Support/ Replica)-40 for new campus"
            ]
        },
        {
            "tag": "undergraduate_merit_seats",
            "patterns": [
                " How many merit-based seats does FCIT have for each of its undergraduate (BS) programs?"
            ],
            "responses": [
                "Following are the number of seats:BS Computer Science (Morning/Regular)-around 40 for each campus BS Information Technology (Morning/Regular)-around 40 for each campus BS Software Engineering (Morning/Regular)-around 40 for each campus BS Data Science (Morning/Regular)-40 for new campus BS Data Science (Self Support/ Replica)-40 for new campus"
            ]
        },
        {
            "tag": "graduate_merit_seats",
            "patterns": [
                " How many merit-based seats does FCIT have for each of its graduate (MPhil., MS and PhD) programs?"
            ],
            "responses": [
                "Following are the number of seats: M.Phil. Computer Science-40 PhD Computer Science-15 MS Data Science-40 Phd Data Science-20"
            ]
        },
        {
            "tag": "equivalence_certificate",
            "patterns": [
                " Is Equivalence Certificate required to submit if the candidate whose name appears in the merit list, has its terminal degree from any University other than Punjab University?"
            ],
            "responses": [
                " Equivalence Certificate is a must document to submit if the candidate is offered admission in M.Phil. CS, MS Data Science, or PhD CS. This is for those candidates who have their terminal degree from any University other than Punjab University. Without this document, admission would not be granted."
            ]
        },
        {
            "tag": "Dean_of_FCIT",
            "patterns": [
                " Who is Dean Faculty of Computing and Information Technology?"
            ],
            "responses": [
                " Dr. Shahzad Sarwar"
            ]
        },
        {
            "tag": "online_distance_learning",
            "patterns": [
                "Do you offer online or distance learning programs?"
            ],
            "responses": [
                "Yes. PUCIT offers the following courses: Computer Organization and Assembly Language Programming System Programming with Linux Oprating System with Linux lnternetworking with Linux C-Refresher Basic Web Development Cloud Computing Life Skills and Self Development Software Engineenering, Project Management Digital Logic Design EAD"
            ]
        },
        {
            "tag": "resources_for_students_with_disabilities",
            "patterns": [
                "What resources are available for students with disabilities?"
            ],
            "responses": [
                "There are especial seats reserved for students with disabilities and teachers provide specific. attention to them"
            ]
        },
        {
            "tag": "PUCIT_establishment",
            "patterns": [
                "When PUCIT was established?"
            ],
            "responses": [
                "PUCIT was established in 2000 as a college of the University of the Punjab."
            ]
        },
        {
            "tag": "special_seats_for_disabled_students",
            "patterns": [
                "Are there special seats for disabled students?"
            ],
            "responses": [
                "Yes, there are special seats available."
            ]
        },
        {
            "tag": "CS_vs_SE",
            "patterns": [
                "Difference between CS and SE?"
            ],
            "responses": [
                "Computer Science (CS) focuses on the theoretical aspects of computing, algorithms, and data structures. Software Engineering (SE) focuses on the practical application of engineering principles to develop and maintain software systems. CS emphasizes theory, while SE focuses on software development practices and methodologies."
            ]
        },
        {
            "tag": "CS_vs_DS",
            "patterns": [
                "Difference between CS and DS?"
            ],
            "responses": [
                "CS provides the theoretical foundations and tools necessary for computing, while DS is an application-driven field that leverages data analysis and statistical methods to extract valuable insights and solve real-world problems."
            ]
        },
        {
            "tag": "DS_vs_SE",
            "patterns": [
                "Difference between DS and SE?"
            ],
            "responses": [
                "DS is centered around working with data and extracting insights, while SE is concerned with the engineering aspects of software development. DS professionals analyze data to generate insights, while SE professionals design and build software systems following engineering principles and practices."
            ]
        },
        {
            "tag": "DS_vs_IT",
            "patterns": [
                "Difference between DS and IT?"
            ],
            "responses": [
                "DS is centered around data analysis and extracting insights, while IT is focused on managing and implementing technology infrastructure and applications. DS professionals work with data, while IT professionals handle the technology infrastructure and systems that support data processing and utilization."
            ]
        },
        {
            "tag": "IT_vs_SE",
            "patterns": [
                "Difference between IT and SE?"
            ],
            "responses": [
                "Information Technology (IT) focuses on the management and implementation of technology infrastructure, systems, and applications. Software Engineering (SE) focuses on the design, development, and maintenance of software systems. IT focuses on technology management, while SE focuses on software development."
            ]
        },
        {
            "tag": "admission_criteria",
            "patterns": [
                "What is the admission criteria?"
            ],
            "responses": [
                "The admission criteria for PUCIT typically include completion of intermediate or equivalent education, performance in an entrance test, and merit calculation based on test scores and academic qualifications. For specific and up-to-date information, it's best to refer to the official PUCIT website or contact their admissions office."
            ]
        },
        {
            "tag": "marks_required_FSc",
            "patterns": [
                "How many marks required in FSc?"
            ],
            "responses": [
                "The specific marks requirement in FSc (or equivalent) for admission in PUCIT can vary from year to year and depend on the program you are applying to. It's best to check the official PUCIT website or contact their admissions office for the most accurate and up-to-date information regarding the minimum marks required for admission."
            ]
        },
        {
            "tag": "marks_required_Matric",
            "patterns": [
                "How many marks required in Matric?"
            ],
            "responses": [
                "The specific marks requirement in Matric (or equivalent) for admission in PUCIT can vary from year to year and depend on the program you are applying to. It's best to check the official PUCIT website or contact their admissions office for the most accurate and up-to-date information regarding the minimum marks required for admission."
            ]
        },
        {
            "tag": "marks_required_Entry_Test",
            "patterns": [
                "How many marks required in Entry Test?"
            ],
            "responses": [
                "The specific marks requirement in Entry Test for admission in PUCIT can vary from year to year and depend on the program you are applying to. It's best to check the official PUCIT website or contact their admissions office for the most accurate and up-to-date information regarding the minimum marks required for admission."
            ]
        },
        {
            "tag": "marks_deduction_for_repeaters",
            "patterns": [
                "Is there any deduction of marks for repeaters?"
            ],
            "responses": [
                "Two marks will be deducted from (percent academic) marks obtained out of 100 marks for each late year to a maximum of five (5) years."
            ]
        },
        {
            "tag": "bonus_marks_for_hafiz_e_Quran",
            "patterns": [
                "Do hafiz e Quran get bonus marks?"
            ],
            "responses": [
                "Hafiz e Quran gets 20 extra marks on admission after verification."
            ]
        },
        {
            "tag": "scholarships_and_financial_aid",
            "patterns": [
                "Can you provide information about scholarships and financial aid?"
            ],
            "responses": [
                "PUCIT offers merit-based scholarships and need-based financial aid to deserving students. Students can apply for scholarships based on their academic achievements and financial circumstances. Additionally, external scholarships may also be available. For specific and up-to-date information, it's best to refer to the official PUCIT website or contact their scholarships/financial aid office."
            ]
        },
        {
            "tag": "campus_preference",
            "patterns": [
                "Which campus is better New or Old?"
            ],
            "responses": [
                "The choice between PUCIT's New Campus and Old Campus depends on individual preferences. The New Campus offers modern facilities, while the Old Campus has a rich historical background. Consider factors like location, infrastructure, and personal preferences when deciding which campus is better for you."
            ]
        },
        {
            "tag": "class_timings",
            "patterns": [
                " What are the timings for classes at FCIT? "
            ],
            "responses": [
                "Morning classes at PUCIT typically start around 1:00 PM and may extend until 4:30pm or 5:00pm. However, timings can vary based on the program and semester schedule. For the most accurate information, please refer to the official PUCIT website or contact the relevant department."
            ]
        },
        {
            "tag": "PUCIT_scope_in_market",
            "patterns": [
                "What is the scope of PUCIT in market?"
            ],
            "responses": [
                "Great scope of pucit students. Evey big software house have a lot of software engineers from PUCIT."
            ]
        },
        {
            "tag": "job_rate_of_PUCIT_students",
            "patterns": [
                "What is the job rate of a pucit student ?"
            ],
            "responses": [
                "Almost 95% of PUCIT graduates get job."
            ]
        },
        {
            "tag": "laptop_scheme",
            "patterns": [
                "Is there any Iaptop scheme for pucit students ?"
            ],
            "responses": [
                "There is no laptop scheme for students of PUCIT."
            ]
        },
        {
            "tag": "transfer_to_PUCIT",
            "patterns": [
                "Can we go to pucit after 4 semesters in other universities? "
            ],
            "responses": [
                "Pucit follows the policy of university of punjab you can see the details from its website."
            ]
        },
        {
            "tag": "earning_opportunities_as_student",
            "patterns": [
                "What are the ways to earn as a student from PUCIT?"
            ],
            "responses": [
                "You can always make a community to start projects as a freelancer or you can become TA of some specific subjects. Also you can get need based scholerships from university as well."
            ]
        },
        {
            "tag": "teacher_assistant_opportunity",
            "patterns": [
                "Can students work as a teacher's assistant in PUCIT?"
            ],
            "responses": [
                "Yes, TA ship is available in the university. You can always contact a university professor to work with him"
            ]
        },
        {
            "tag": "TA_compensation",
            "patterns": [
                "How much TA made in PUCIT? "
            ],
            "responses": [
                "As per the current policy 8000 rupees is rewarded to a TA."
            ]
        },
        {
            "tag": "marking_policy",
            "patterns": [
                "What marking policy pucit follows?"
            ],
            "responses": [
                "PUCIT follows absolute marking system."
            ]
        }
    ]
}